n5/src/Documents/Waybill/Waybill.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Waybill</name>
  <registerRecords>AccumulationRegister.FuelExcess</registerRecords>
  <registerRecords>AccumulationRegister.WaybillWorks</registerRecords>
  <registerRecords>AccumulationRegister.FuelToExpense</registerRecords>
  <registerRecords>AccumulationRegister.WaybillWorksByWorkTypes</registerRecords>
  <registerRecords>AccumulationRegister.FuelExcessTurnovers</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalEquipmentsWork</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Car</name>
    <type>
      <types>CatalogRef.Cars</types>
    </type>
  </attributes>
  <attributes>
    <name>CoefficientCar</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CoefficientConsumption</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CoefficientTrailerI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CoefficientTrailerII</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOpening</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver1</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver2</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>EngineHoursAvg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineHoursMax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineHoursMin</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EquipmentWorkTime</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseEngineAvg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseEngineMax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseEngineMin</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseEquipment</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseOdometer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FuelEquipment</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelExpenseMethod</name>
    <type>
      <types>EnumRef.FuelExpenseMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelHours</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelInventory</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelMain</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelOther</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>MileageCity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageToWork</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageTrailerI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageTrailerII</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageTrailerWithoutI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageTrailerWithoutII</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageWithoutOdometer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OdometerEnd</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OdometerStart</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OtherFuelExpense</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductFeature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>QuantityTrips</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalMileage</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Trailer</name>
    <type>
      <types>CatalogRef.CarTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>WaybillNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillSeries</name>
    <type>
      <types>DefinedType.ReferenceSeries</types>
    </type>
  </attributes>
  <attributes>
    <name>WaybillType</name>
    <type>
      <types>EnumRef.WaybillTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkTime</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>FuelBalances</name>
    <attributes>
      <name>Fuel</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Trips</name>
    <attributes>
      <name>AdditionalEquipmentsWork</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CoefficientConsumption</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EquipmentWorkTime</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseOdometer</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Mileage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MileageCargo</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OdometerEnd</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OdometerStart</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Trailer</name>
      <type>
        <types>CatalogRef.CarTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>TrailerWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Weight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Verso</name>
    <attributes>
      <name>Customer</name>
      <type>
        <types>CatalogRef.Organizations</types>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomerDivision</name>
      <type>
        <types>CatalogRef.CustomerDivisions</types>
      </type>
    </attributes>
    <attributes>
      <name>DateEnd</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>DateStart</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>EngineHours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Mileage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OdometerEnd</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OdometerStart</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Work</name>
      <type>
        <types>EnumRef.CarWorkTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>WorkTime</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/AccumulationRegisters/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Items</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Series</name>
    <type>
      <types>CatalogRef.Series</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

n5/src/AccumulationRegisters/FuelToExpense/FuelToExpense.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>FuelToExpense</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Car</name>
    <type>
      <types>CatalogRef.Cars</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Fuel</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

n5/src/AccumulationRegisters/FuelExcess/FuelExcess.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>FuelExcess</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </resources>
  <dimensions>
    <name>Car</name>
    <type>
      <types>CatalogRef.Cars</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Driver</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Fuel</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

n5/src/Documents/Waybill/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then
	
Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	DocumentPresentation.StandardFields ( Fields, StandardProcessing );

EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	DocumentPresentation.StandardPresentation ( Metadata.Documents.Waybill.Synonym, Data, Presentation, StandardProcessing );
	
EndProcedure

#region Posting

Function Post ( Env ) export
	
	getData ( Env );
	makeFuelToExpense ( Env );
	makeWaybillWorksByWorkTypes ( Env );
	makeWaybillWorks ( Env );
	if ( Env.Fields.FuelInventory ) then
		makeFuelInventory ( Env );
	endif; 
	flagRegisters ( Env );
	return true;
	
EndFunction

Procedure getData ( Env )

	sqlFields ( Env );
	getFields ( Env );
	sqlFuelToExpense ( Env );
	sqlVerso ( Env );
	sqlFuelBalances ( Env );
	sqlFuelInventory ( Env );
	getTables ( Env );
	
EndProcedure

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select Document.Date as Date, Document.DateOpening as DateOpening, Document.Car as Car, Document.FuelInventory as FuelInventory,
	|	Document.PointInTime as Timestamp, Document.Driver1 as Driver1, Document.WaybillType as WaybillType, Document.Car.Warehouse as Warehouse
	|from Document.Waybill as Document
	|where Document.Ref = &Ref
	|";
	Env.Selection.Add ( s );	
	
EndProcedure

Procedure getFields ( Env )
	
	Env.Q.SetParameter ( "Ref", Env.Ref );
	SQL.Perform ( Env );
	
EndProcedure

Procedure sqlFuelToExpense ( Env )
	
	s = "
	|select FuelData.Fuel as Fuel, sum ( FuelData.Quantity ) as Quantity
	|into FuelToExpense
	|from (
	|	select Document.FuelMain as Fuel, Document.ExpenseOdometer as Quantity
	|	from Document.Waybill as Document
	|	where Document.Ref = &Ref
	|	union all
	|	select Document.FuelEquipment, Document.ExpenseEquipment
	|	from Document.Waybill as Document
	|	where Document.Ref = &Ref
	|	union all
	|	select Document.FuelOther, Document.OtherFuelExpense
	|	from Document.Waybill as Document
	|	where Document.Ref = &Ref
	|	union all
	|	select Document.FuelHours, ( Document.ExpenseEngineMax + Document.ExpenseEngineAvg + Document.ExpenseEngineMin )
	|	from Document.Waybill as Document
	|	where Document.Ref = &Ref ) as FuelData
	|group by FuelData.Fuel
	|having sum ( FuelData.Quantity ) > 0
	|;
	|// #FuelToExpense
	|select FuelToExpense.Fuel as Fuel, FuelToExpense.Quantity as Quantity
	|from FuelToExpense as FuelToExpense
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure sqlVerso ( Env )
	
	s = "
	|select Verso.Customer as Customer, Verso.CustomerDivision as CustomerDivision, Verso.Work as Work, beginofperiod ( Verso.DateStart, day ) as DateStart,
	|	sum ( Verso.EngineHours ) as EngineHours, sum ( Verso.WorkTime ) as WorkTime, sum ( Verso.Mileage ) as Mileage
	|into Verso
	|from Document.Waybill.Verso as Verso
	|where Verso.Ref = &Ref
	|group by Verso.Customer, Verso.CustomerDivision, Verso.Work, beginofperiod ( Verso.DateStart, day )
	|;
	|// #Verso
	|select Verso.Customer as Customer, Verso.CustomerDivision as CustomerDivision, Verso.DateStart as DateStart, Verso.Work as Work,
	|	Verso.EngineHours as EngineHours, Verso.WorkTime as WorkTime, Verso.Mileage as Mileage
	|from Verso as Verso
	|;
	|// #WorkTime
	|select Verso.DateStart as DateStart, sum ( Verso.WorkTime ) as WorkTime
	|from Verso as Verso
	|where Verso.Work <> value ( Enum.CarWorkTypes.Absenteeism )
	|group by Verso.DateStart
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure sqlFuelBalances ( Env )
	
	s = "
	|// #FuelBalances
	|select FuelBalances.Fuel as Fuel, FuelBalances.Quantity as Quantity
	|from Document.Waybill.FuelBalances as FuelBalances
	|where FuelBalances.Ref = &Ref
	|";
	Env.Selection.Add ( s );	
	
EndProcedure

Procedure sqlFuelInventory ( Env )
	
	s = "
	|select FuelBalances.Fuel as Fuel, &Warehouse as Warehouse
	|into FuelBalances
	|from Document.Waybill.FuelBalances as FuelBalances
	|where FuelBalances.Ref = &Ref
	|index by Fuel, Warehouse
	|;
	|// #FuelInventory
	|select Items.Fuel as Fuel, sum ( Items.Quantity ) as Deviation, sum ( Items.ExcessBalance )  as ExcessBalance
	|from (
	|		select GoodsBalances.Item as Fuel, sum ( GoodsBalances.QuantityBalance ) as Quantity,
	|			0 as ExcessBalance
	|		from AccumulationRegister.Items.Balance ( &Timestamp,
	|			( Warehouse, Item ) in ( select Warehouse, Fuel from FuelBalances )
	|			) as GoodsBalances
	|		group by GoodsBalances.Item
	|		union all
	|		select FuelBalances.Fuel, - FuelBalances.Quantity, 0
	|		from Document.Waybill.FuelBalances as FuelBalances
	|		where FuelBalances.Ref = &Ref
	|		union all
	|		select FuelToExpense.Fuel, - FuelToExpense.QuantityBalance, 0
	|		from AccumulationRegister.FuelToExpense.Balance ( &Timestamp, Car = &Car ) as FuelToExpense
	|		union all
	|		select FuelToExpense.Fuel, - FuelToExpense.Quantity, 0
	|		from FuelToExpense as FuelToExpense
	|		union all
	|		select Overconsumption.Fuel,
	|			case when Overconsumption.QuantityBalance > 0 then - Overconsumption.QuantityBalance else 0 end,
	|			Overconsumption.QuantityBalance
	|		from AccumulationRegister.FuelExcess.Balance ( &Timestamp, Car = &Car ) as Overconsumption
	|) as Items
	|group by Items.Fuel
	|having sum ( Items.Quantity ) <> 0
	|";
	Env.Selection.Add ( s );	
	
EndProcedure

Procedure getTables ( Env )
	
	Env.Q.SetParameter ( "Ref", Env.Ref );
	Env.Q.SetParameter ( "Car", Env.Fields.Car );
	Env.Q.SetParameter ( "Warehouse", Env.Fields.Warehouse );
	Env.Q.SetParameter ( "Timestamp", Env.Fields.Timestamp );
	SQL.Perform ( Env );
	
EndProcedure

Procedure makeFuelToExpense ( Env )

	table = Env.FuelToExpense;
	recordset = Env.Registers.FuelToExpense;
	for each row in table do
		movement = recordset.AddReceipt ();
		movement.Period = Env.Fields.Date;
		movement.Fuel = row.Fuel;
		movement.Car = Env.Fields.Car;
		movement.Quantity = row.Quantity;
	enddo; 
	
EndProcedure

Procedure makeWaybillWorksByWorkTypes ( Env )

	recordset = Env.Registers.WaybillWorksByWorkTypes;
	table = Env.Verso;
	for each row in table do
		movement = recordset.Add ();
		movement.Period = Env.Fields.Date;
		movement.WorkDay = row.DateStart;
		movement.Car = Env.Fields.Car;
		movement.Customer = row.Customer;
		movement.CustomerDivision = row.CustomerDivision;
		movement.Work = row.Work;
		movement.WorkTime = row.WorkTime;
		movement.Mileage = row.Mileage;
		movement.MotorHours = row.EngineHours;
	enddo; 

EndProcedure 

Procedure makeWaybillWorks ( Env )

	table = Env.WorkTime;
	lastIndex = table.Count () - 1;
	if ( lastIndex = -1 ) then
		return;
	endif; 
	recordset = Env.Registers.WaybillWorks;
	start = BegOfDay ( Env.Fields.DateOpening );
	end = table [ lastIndex ].DateStart;
	while ( start <= end ) do
		row = table.Find ( start, "DateStart" );
		if ( row = Undefined ) then
			row = new Structure ( "DateStart, WorkTime", start, 0 );
		endif;
		movement = recordset.Add ();
		movement.Period = Env.Fields.Date;
		movement.WorkDay = row.DateStart;
		movement.Car = Env.Fields.Car;
		movement.Fact = row.WorkTime;
		if ( Env.Fields.WaybillType = Enums.WaybillTypes._11 ) then
			movement.Norm = 11 * 60;
		elsif ( Env.Fields.WaybillType = Enums.WaybillTypes._22 ) then
			movement.Norm = 22 * 60;
		endif; 
		start = start + 86400;
	enddo; 

EndProcedure 

Procedure makeFuelInventory ( Env )
	
	writeOffRecords = Env.Registers.FuelToExpense;
	excessRecords = Env.Registers.FuelExcess;
	excessTurnovers = Env.Registers.FuelExcessTurnovers;
	excessRecords.Clear ();
	excessTurnovers.Clear ();
	table = Env.FuelInventory;
	for each row in table do
		deviation = row.Deviation;
		if ( deviation > 0 ) then
			overconsumption = deviation;
			economy = ? ( row.ExcessBalance < 0, - row.ExcessBalance, 0 );
			if ( economy > 0 ) then
				movement = writeOffRecords.Add ();
				movement.Period = Env.Fields.Date;
				movement.Fuel = row.Fuel;
				movement.Car = Env.Fields.Car;
				movement.Quantity = Min ( economy, overconsumption );
			endif;
			movement = excessRecords.Add ();
			movement.Period = Env.Fields.Date;
			movement.Fuel = row.Fuel;
			movement.Driver = Env.Fields.Driver1;
			movement.Car = Env.Fields.Car;
			movement.Quantity = overconsumption;
			movement = excessTurnovers.Add ();
			movement.Period = Env.Fields.Date;
			movement.Fuel = row.Fuel;
			movement.Driver = Env.Fields.Driver1;
			movement.Car = Env.Fields.Car;
			movement.Excess = overconsumption;
		else
			economy = - deviation;
			overconsumption = ? ( row.ExcessBalance > 0, row.ExcessBalance, 0 );
			if ( overconsumption > 0 ) then
				movement = writeOffRecords.Add ();
				movement.Period = Env.Fields.Date;
				movement.Fuel = row.Fuel;
				movement.Car = Env.Fields.Car;
				movement.Quantity = - Min ( economy, overconsumption );
			endif;
			movement = excessRecords.AddExpense ();
			movement.Period = Env.Fields.Date;
			movement.Fuel = row.Fuel;
			movement.Driver = Env.Fields.Driver1;
			movement.Car = Env.Fields.Car;
			movement.Quantity = economy;
			movement = excessTurnovers.Add ();
			movement.Period = Env.Fields.Date;
			movement.Fuel = row.Fuel;
			movement.Driver = Env.Fields.Driver1;
			movement.Car = Env.Fields.Car;
			movement.Economy = economy;
		endif; 
	enddo; 
	
EndProcedure 

Procedure flagRegisters ( Env )
	
	registers = Env.Registers; 
	registers.FuelToExpense.Write = true;
	registers.FuelExcess.Write = true;
	registers.FuelExcessTurnovers.Write = true;
	registers.WaybillWorks.Write = true;
	registers.WaybillWorksByWorkTypes.Write = true;
	
EndProcedure

#endregion

#region Printing

Function Print ( Params, Env ) export
	
	setPageSettings ( Params );	
	getPrintData ( Params, Env );
	put ( Params, Env );
	return true;
	
EndFunction

Procedure setPageSettings ( Params )
	
	Params.TabDoc.FitToPage = true;
	Params.TabDoc.PageOrientation = ? ( Params.Template = "WaybillCar", PageOrientation.Portrait, PageOrientation.Landscape );
	
EndProcedure

Procedure getPrintData ( Params, Env )
	
 	sqlPrintData ( Env );
	Env.Q.SetParameter ( "Ref", Params.Reference );
	SQL.Perform ( Env );
	
EndProcedure 

Procedure sqlPrintData ( Env )
	
	s = "
	|// @Fields
	|select Waybill.Car.CarType as CarType, Waybill.Car.CarNumber as CarNumber, Waybill.Car.GarageNumber as GarageNumber,
	|	Waybill.Driver1.LastName + "" "" + Waybill.Driver1.FirstName as Driver1Name, Waybill.Driver1.Code as Driver1Code, Waybill.DateOpening as DateOpening,
	|	presentation ( Waybill.Company ) as Company, Waybill.Company.CodeFiscal as CodeFiscal, Waybill.Date as Date, Waybill.WaybillNumber as WaybillNumber, 
	|	Waybill.WaybillSeries as WaybillSeries
	|from Document.Waybill as Waybill
	|where Waybill.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure put ( Params, Env )
	
	area = Env.T.GetArea ();
	area.Parameters.Fill ( Env.Fields );
	Params.TabDoc.Put ( area );
	
EndProcedure 

#endregion

#endif
